kanudog/CodeRing/esp32/firmware/sdkconfig.defaults
# Board facts, read off the real unit with esptool (see esp32/README.md).
CONFIG_IDF_TARGET="esp32s3"

# 32 MB flash, quad mode — the eFuse says quad, so do not "upgrade" this.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ESP32-S3R8: 8 MB octal PSRAM. The LVGL frame buffers and, later, the
# session struct live here rather than in scarce internal RAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 1 kHz tick: LVGL animation and touch sampling get millisecond resolution.
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The console is the built-in USB-Serial/JTAG port (no UART bridge on this
# board), which is what `idf.py monitor` attaches to.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# The 96 kB session struct goes to PSRAM (EXT_RAM_BSS_ATTR in main.c).
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# LVGL's built-in allocator is a fixed 64 kB pool, and the app now builds six
# screens' worth of objects up front — it ran out and crashed inside glyph
# drawing. The C library allocator uses the system heap instead, where there
# is 275 kB of internal RAM and 7 MB of PSRAM.
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_BUILTIN_MALLOC=n

# …and then the C allocator put every one of those objects in INTERNAL RAM,
# because ALWAYSINTERNAL defaults to 16 kB and an LVGL object is far smaller
# than that. With M5's screens added, internal RAM ran low enough that the SPI
# driver could no longer allocate a DMA buffer to push pixels:
#
#   E spi_master: setup_dma_priv_buffer: Failed to allocate priv TX buffer
#   E lcd_panel.io.spi: spi transmit (queue) color failed
#
# Half the flushes failed, so bands of the previous screen stayed on the glass
# and the device looked like two screens fighting over it. Nothing had crashed
# — it simply could not draw.
#
# Small allocations now prefer PSRAM, and a bigger slice of internal RAM is
# reserved for the DMA-capable allocations only internal RAM can satisfy.
# LVGL objects are touched at UI rates, not per pixel, so PSRAM's latency does
# not show.
# Zero, not 1024. This is the threshold BELOW which malloc prefers internal
# RAM, and every LVGL object is a few hundred bytes — so at 1024 all seven
# screens still landed in the scarce pool the display needs for DMA. That was
# survivable until the TV link began coming up at boot and Wi-Fi took 57 kB of
# it. At zero, LVGL lives in PSRAM, which it can afford: its objects are
# touched at UI rates, not per pixel.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=n
# Big timer numerals have to be readable at arm's length.
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# The TV link now comes up at BOOT (the setting is remembered), and the Wi-Fi
# stack costs 57 kB of INTERNAL RAM — the same scarce pool the display needs
# for DMA. Measured: internal free after the screens fell from 213 kB to 141 kB
# the moment the access point started at startup, and the panel went back to
# failing flushes and showing bands of the previous screen.
#
# So Wi-Fi and lwIP buffers go to PSRAM where they can, and the buffer counts
# come down to what one client fetching a small JSON page actually needs
# instead of the defaults, which are sized for a busy station.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
